4DS4/Lab2/Experiment3_freertos_hello/board/pin_mux.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MK66FN2M0xxx18
package_id: MK66FN2M0VMD18
mcu_data: ksdk2_0
processor_version: 0.7.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: E10, peripheral: UART0, signal: RX, pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/SDRAM_D17/EWM_IN/TPM_CLKIN0}
  - {pin_num: E9, peripheral: UART0, signal: TX, pin_signal: TSI0_CH10/PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/FB_AD16/SDRAM_D16/EWM_OUT_b/TPM_CLKIN1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
	/* Port A Clock Gate Control: Clock enabled */
	CLOCK_EnableClock(kCLOCK_PortA);
	/* Port B Clock Gate Control: Clock enabled */
	CLOCK_EnableClock(kCLOCK_PortB);
	/* Port C Clock Gate Control: Clock enabled */
	CLOCK_EnableClock(kCLOCK_PortC);
	/* Port E Clock Gate Control: Clock enabled */
	CLOCK_EnableClock(kCLOCK_PortE);


	PORT_SetPinMux(PORTC, 1U, kPORT_MuxAlt4);
	PORT_SetPinMux(PORTA, 6U, kPORT_MuxAlt3);

	/* PORTA2 (pin K6) is configured as TRACE_SWO */
//	PORT_SetPinMux(BOARD_TRACE_SWO_PORT, BOARD_TRACE_SWO_PIN, kPORT_MuxAlt7);

	PORT_SetPinMux(PORTC, 13U, kPORT_MuxAlt3);	//UART4 CTS PTC13
	PORT_SetPinMux(PORTC, 14U, kPORT_MuxAlt3);	//UART4 RX PTC14
	PORT_SetPinMux(PORTC, 15U, kPORT_MuxAlt3);	//UART4 TX PTC15
	PORT_SetPinMux(PORTE, 27U, kPORT_MuxAlt3);	//UART4 RTS PTE27


//	PORTA->PCR[2] = ((PORTA->PCR[2] &
//			/* Mask bits to zero which are setting */
//			(~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))
//
//			/* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
//			 * corresponding PE field is set. */
//			| PORT_PCR_PS(kPORT_PullDown)
//
//			/* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
//			| PORT_PCR_PE(kPORT_PullDisable));
//
//	/* PORTB16 (pin E10) is configured as UART0_RX */
//	PORT_SetPinMux(BOARD_DEBUG_UART_RX_PORT, BOARD_DEBUG_UART_RX_PIN, kPORT_MuxAlt3);
//
//	/* PORTB17 (pin E9) is configured as UART0_TX */
//	PORT_SetPinMux(BOARD_DEBUG_UART_TX_PORT, BOARD_DEBUG_UART_TX_PIN, kPORT_MuxAlt3);
//
//	SIM->SOPT5 = ((SIM->SOPT5 &
//			/* Mask bits to zero which are setting */
//			(~(SIM_SOPT5_UART0TXSRC_MASK)))
//
//			/* UART 0 transmit data source select: UART0_TX pin. */
//			| SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
